;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;;  File : USBIPAdminLang.ini
;;  Version 1.1
;;  This int file contains the strings that gets displayed in USB Server Admin Utility application
;;  (c) Copyright - 2008
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Instructions to add the support for any new language:
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; If you want to add any additional language support, add a section with that System Language Identifier.
; 1. Section name should be System Language Id specified with in []. 
; A table is mentioned at the end of this file which has various System Language ID's.
; Ex: [0x0411] which adds the support of Japanese language.

; 2. Add a key with the same language id and specify the key value as the language as specified in the table.
; Ex:0x0411=Japanese
; Place all your Japanese translated strings under this section with the same key names as specified in English.
;--------------------------------------------------------------------------------



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[0x0409]
0x0409=English (United States)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;To set the text to be displayed on tray tooltip.
TRAY_TOOLTIP_NAME					=	"USBIP Admin Utility"

;To set the company name in "About Dialog Box".
CUST_NAME						=	""

; To set the title of the About Dialog box.
; To set the message boxes titles.
; To set the module name in the log file.
; To set the tray popup menu item (1st item)
MODULE_NAME						=	"USBIP Admin "

;To Set the text for Menu Items

SERVERMGR_CONFIG_TRACK_MENU_SEARCH_SERVER		=	"&Search Servers"
SERVERMGR_CONFIG_TRACK_MENU_SEARCH_BY_MAC		=	"S&earch by MAC ID"
SERVERMGR_CONFIG_TRACK_MENU_UNLOCK			=	"&Unlock"
SERVERMGR_CONFIG_TRACK_MENU_UPGRADE_FW			=	"Upgrade &Firmware"
SERVERMGR_CONFIG_TRACK_MENU_SERVER_CONF			=	"Server &Configuration"
SERVERMGR_CONFIG_TRACK_MENU_RESTORE_DEFAULTS		=	"&Restore Defaults"

DEVICE_MAPPING_TRACK_MENU_START_DEVICE_MAPPING		=	"&Start Device Mapping"
DEVICE_MAPPING_TRACK_MENU_STOP_DEVICE_MAPPING		=	"St&op Device Mapping"
DEVICE_MAPPING_TRACK_MENU_CONNECT			=	"&Connect"
DEVICE_MAPPING_TRACK_MENU_DISCONNECT			=	"&Disconnect"
DEVICE_MAPPING_TRACK_MENU_PRINTER_AUTO_CONNECT		=	"&Printer Sharing"
DEVICE_MAPPING_TRACK_MENU_DEVICE_REQUEST		=	"Device &Request"
DEVICE_MAPPING_TRACK_MENU_DEVICE_SETTINGS		=	"S&ettings"

BOTTOM_VIEW_TRACK_MENU_CLEAR				=	"&Clear"
BOTTOM_VIEW_TRACK_MENU_SAVE_TO_FILE			=	"&Save To File"

DETAILS_VIEW_TRACK_MENU_REFRESH				=	"&Refresh"

PRINTER_POPUP_TRACK_MENU_REMOVE				=	"&Remove"

TRAY_POPUP_TRACK_MENU_START_DEVICE_MAPPING		=	"&Start Device Mapping"
TRAY_POPUP_TRACK_MENU_STOP_DEVICE_MAPPING		=	"St&op Device Mapping"
TRAY_POPUP_TRACK_MENU_EXIT				=	"E&xit"

MAIN_FRAME_MENU_FILE					=	"&File"
MAIN_FRAME_MENU_FILE_SETTINGS				=	"&Settings"
MAIN_FRAME_MENU_FILE_ADD_TO_WIN_FIREWALL		=	"&Add To Windows Firewall"
MAIN_FRAME_MENU_FILE_EXIT				=	"E&xit"

MAIN_FRAME_MENU_FUNCTIONS				=	"Fu&nctions"
MAIN_FRAME_MENU_FUNCTIONS_DEVICE_MAPPING		=	"&Device Mapping"
MAIN_FRAME_MENU_FUNCTIONS_SERVER_MANAGER		=	"&Server Manager"

MAIN_FRAME_MENU_SERVER_MANAGER				=	"&Server Manager"
MAIN_FRAME_MENU_SERVER_MANAGER_SEARCH_SERVER		=	"&Search Servers"
MAIN_FRAME_MENU_SERVER_MANAGER_SEARCH_BY_MAC		=	"S&earch by MAC ID"
MAIN_FRAME_MENU_SERVER_MANAGER_UNLOCK			=	"&Unlock"
MAIN_FRAME_MENU_SERVER_MANAGER_UPGRADE_FW		=	"Upgrade &Firmware"
MAIN_FRAME_MENU_SERVER_MANAGER_SERVER_CONF		=	"Server &Configuration"
MAIN_FRAME_MENU_SERVER_MANAGER_RESTORE_DEFAULTS		=	"&Restore Defaults"

MAIN_FRAME_MENU_DEVICE_MAPPING				=	"&Device Mapping"
MAIN_FRAME_MENU_DEVICE_MAPPING_START_DEVICE_MAPPING	=	"&Start Device Mapping"
MAIN_FRAME_MENU_DEVICE_MAPPING_STOP_DEVICE_MAPPING	=	"St&op Device Mapping"
MAIN_FRAME_MENU_DEVICE_MAPPING_CONNECT			=	"&Connect"
MAIN_FRAME_MENU_DEVICE_MAPPING_DISCONNECT		=	"&Disconnect"
MAIN_FRAME_MENU_DEVICE_MAPPING_PRINTER_AUTO_CONNECT	=	"&Printer Sharing"
MAIN_FRAME_MENU_DEVICE_MAPPING_DEVICE_REQUEST		= 	"Device &Request"
MAIN_FRAME_MENU_DEVICE_MAPPING_DEVICE_SETTING		=	"S&ettings"

MAIN_FRAME_MENU_VIEW					=	"&View"
MAIN_FRAME_MENU_VIEW_TOOLBAR				=	"View &Toolbar"
MAIN_FRAME_MENU_VIEW_FUNCTIONAL_PANEL			=	"View &Functional Panel"
MAIN_FRAME_MENU_VIEW_LOG_PANEL				=	"View &Log Panel"
MAIN_FRAME_MENU_VIEW_DETAILS_PANEL			=	"View &Details Panel"

MAIN_FRAME_MENU_HELP					=	"&Help"
MAIN_FRAME_MENU_HELP_ONLINE_HELP			=	"Online &Help"
MAIN_FRAME_MENU_HELP_ABOUT				=	"&About"

;-------------------------------------------------------------------------------------------------------

;Function View Messages

FUNCTION_VIEW_MESSAGE1					=	"Failed to open a handle to the Bus Driver!!"
FUNCTION_VIEW_MESSAGE2					=	"Failed to initialize the Bus Driver!!"
FUNCTION_VIEW_MESSAGE3					=	"Faild to close the Bus Driver handle!!"
FUNCTION_VIEW_MESSAGE4					=	"Server is password protected !!"


;-------------------------------------------------------------------------------------------------------

;To Set the text for "About Box"

ABOUT_BOX_CAPTION					=	"About "

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Progress Bar Window"

PROGRESS_BAR_PLEASE_WAIT				=	"Please Wait..."

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Busy Dialog Box"

BUSY_DLG_BOX_PLEASE_WAIT				=	"Please Wait..."

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Basic Page"

BASIC_PAGE_TITLE					=	"Basic Settings"
BASIC_PAGE_MODIFY					=	"Modify"
BASIC_PAGE_SERVR_NAME					=	"Server Name"
BASIC_PAGE_ERROR_MESSAGE				=	"Enter Server Name"
BASIC_PAGE_ERROR_MESSAGE1				=	"Enter only alpha numeric values for server name"

;-------------------------------------------------------------------------------------------------------

;To Set the text for "IP Settings Page"

IP_SETTINGS_PAGE_TITLE					=	"IP Settings"
IP_SETTINGS_PAGE_MODIFY					=	"Modify"
IP_SETTINGS_PAGE_IP_CONFIGURATION			=	"IP Configuration"
IP_SETTINGS_PAGE_IP_ADDRESS				=	"IP Address"
IP_SETTINGS_PAGE_SUBNET_MASK				=	"Subnet Mask"
IP_SETTINGS_PAGE_GATEWAY				=	"Gateway"
IP_SETTINGS_PAGE_COMBO_CONTROL_ITEM_1			=	"Static"
IP_SETTINGS_PAGE_COMBO_CONTROL_ITEM_2			=	"DHCP"
IP_SETTINGS_PAGE_COMBO_CONTROL_ITEM_3			=	"Unknown"
IP_SETTINGS_PAGE_ERROR_MESSAGE1				=	"Enter IP address."
IP_SETTINGS_PAGE_ERROR_MESSAGE2				=	"Enter subnet mask."
IP_SETTINGS_PAGE_ERROR_MESSAGE3				=	"Enter gateway address."

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Password Page"

PASSWORD_PAGE_TITLE					=	"Password"
PASSWORD_PAGE_MODIFY_FOR_ENABLE_PASSWORD		=	"Modify"
PASSWORD_PAGE_ENABLE_PASSWORD				=	"&Enable Password"
PASSWORD_PAGE_MODIFY_FOR_CHANGE_PASSWORD		=	"Modify"
PASSWORD_PAGE_NEW_PASSWORD				=	"New Password"
PASSWORD_PAGE_CONFIRM_PASSWORD				=	"Confirm Password"
PASSWORD_PAGE_ERROR_MESSAGE1				=	"Enter Password"
PASSWORD_PAGE_ERROR_MESSAGE2				=	"Mismatch in entered password values."
PASSWORD_PAGE_ERROR_MESSAGE3				=	"Enter only alpha numeric values for password"

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Server Configuration" dialog box

SERVER_CONFIGURATION_TITLE				=	"Server Configuartion"
SERVER_CONFIGURATION_INFORMATION			=	"Information"
SERVER_CONFIGURATION_MODEL_NAME				=	"Model Name:"
SERVER_CONFIGURATION_MAC_ADDRESS			=	"MAC Address:"
SERVER_CONFIGURATION_SERIAL_NUMBER			=	"Serial Number:"
SERVER_CONFIGURATION_FIRMWARE_VERSION			=	"Firmware Version:"

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Unlock" dialog box

UNLOCK_DIALOG_TITLE					=	"Unlock"
UNLOCK_DIALOG_GROUP_TITLE				=	"Enter Password"

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Upgrade Firmware" dialog box

UPGRADE_FIRMWARE_DIALOG_TITLE				=	"Upgrade Firmware"
UPGRADE_FIRMWARE_DIALOG_GROUP_TITLE			=	"Give File Path"

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Save Bottom Form List" dialog box

SAVE_BOTTOM_FORM_LIST_DIALOG_TITLE			=	"Save Log"
SAVE_BOTTOM_FORM_LIST_DIALOG_GROUP_TITLE		=	"Save To"

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Printer Auto Connect" dialog box

PRINTER_AUTOCONNECT_DIALOG_BOX_TITLE			=	"Printer Sharing"
PRINTER_AUTOCONNECT_DIALOG_BOX_COLUMN1			=	"Printer Name"
PRINTER_AUTOCONNECT_DIALOG_BOX_COLUMN2			=	"Server IP"
PRINTER_AUTOCONNECT_DIALOG_BOX_COLUMN3			=	"Port"
PRINTER_AUTOCONNECT_DIALOG_BOX_HEADER_TITLE		=	"NOTE:"
PRINTER_AUTOCONNECT_DIALOG_BOX_HEADER_TEXT		=	"The Printer Sharing feature, automatically Connects and Disconnects your printer from your computer every time you give a print.Please make sure your printer has been setup and configured properly to print from your machine, before enabling Printer Sharing feature for your printer.To enable Printer Sharing feature, click the check box next to your Printer's name.Note that enabling Printer Sharing feature will turn off the Device Autoconnect feature automatically."
PRINTER_AUTOCONNECT_ERROR_MESSAGE1			=	"Disconnect %s Printer before choosing the Printer Sharing Feature..!"
PRINTER_AUTOCONNECT_ERROR_MESSAGE2			=	"%s: Is not a obsolete printer!!"
PRINTER_MESSAGE_LIMITED	                                =       "Couldn't save the settings"

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Firmware Upgrade Status" dialog box

FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_TITLE		=	"Firmware Upgrade Status"
FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_STATUS1		=	"Uploading File..."
FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_COLUMN1		=	"S.No."
FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_COLUMN2		=	"IP Address"
FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_COLUMN3		=	"% Completion"
FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_COLUMN4		=	"Status"
FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_STATUS2		=	"Firmware Upgrade Is In Progress. Please Wait!!"
FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_STATUS_SUCCESS	=	"Firmware Upgrade Successfull"
FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_STATUS_FAILED	=	"Firmware Upgrade Failed"
FIRMWARE_UPGRADE_STATUS_DIALOG_BOX_BOTTOM_CAUTION	=	"It may take 5 to 8  minutes to complete firmware upgrade process. Do not unplug the ethernet cable (or) power of the box during firmware upgrade."

;-------------------------------------------------------------------------------------------------------

;To Set the text for "Search For Servers" dialog box

SEARCH_FOR_SRVRS_DIALOG_BOX_TITLE			=	"Searching For Servers"
SEARCH_FOR_SRVRS_DIALOG_BOX_CAPTION_SERVRS_FOUND	=	"Server(s) Found"
SEARCH_FOR_SRVRS_DIALOG_BOX_CAPTION_REMAIN_TIME		=	"Remaining"
SEARCH_FOR_SRVRS_DIALOG_BOX_COLUMN1			=	"Sl.No."
SEARCH_FOR_SRVRS_DIALOG_BOX_COLUMN2			=	"Model"
SEARCH_FOR_SRVRS_DIALOG_BOX_COLUMN3			=	"MAC Address"
SEARCH_FOR_SRVRS_DIALOG_BOX_COLUMN4			=	"IP Address"	

;-------------------------------------------------------------------------------------------------------

;Error message strings

IDS_SETUP_ERRMSG_SWINTERNAL				=	"Internal SW Error"
IDS_STATUS_DIALOG_BOX_CAPTION				=	"Unload Failure"
IDS_STATUS_DIALOG_BOX_REBOOT_ERROR_MESSAGE		=	" failed to Unload. The device may not work properly next time, Please restart the PC."
IDS_STATUS_DIALOG_BOX_SERVER_REBOOT_ERROR_MESSAGE	= 	" failed to Unload. Please restart the PC."


;-------------------------------------------------------------------------------------------------------

;MainFrame Window message strings

MAINFRAME_WINDOW_MESSAGE1				=	"Please stop Device Mapping before exitting the application."
MAINFRAME_WINDOW_MESSAGE2				=	"When using this application, it needs to be added to the exceptions list of the windows firewall.\nDo you want to add this application to the exceptions list?"
MAINFRAME_WINDOW_MESSAGE3				=	"This application entry is already present in windows firewall exception list."
MAINFRAME_WINDOW_MESSAGE4				=	"Client software is not installed !!"
MAINFRAME_WINDOW_MESSAGE5				= 	"Failed to add Application entry to Firewall Exception List. Try again."
MAINFRAME_WINDOW_MESSAGE6				=	"Windows Firewall is supported only on Windows XP and later Windows Versions."
MAINFRAME_WINDOW_MESSAGE7				=	"NetworkThrottlingIndex is updated for better performance. Please restart the PC for applying the changes!!!\n"
MAINFRAME_WINDOW_MESSAGE8				=	_T("Another instance of this application is already running,\nprobably by a different user logged in!!\n")

;-------------------------------------------------------------------------------------------------------

;USBIP Window message strings

USBIP_WINDOW_MESSAGE1					=	"OpenBusEnumDriver Failed!!"
USBIP_WINDOW_MESSAGE2					=	"InitBusEnumDriver Failed!!"
USBIP_WINDOW_MESSAGE3					=	"SpecialServerArrivalRemoval Failed!!"
USBIP_WINDOW_MESSAGE4					=	"Stopping the Device Mapping functionality. Do you want to continue?"
USBIP_WINDOW_MESSAGE5					=	"Press OK to Reboot the System OR CANCEL to Reboot Later."
USBIP_WINDOW_MESSAGE6					=	"This Printer : %s is allready Installed \n & It is in Printer Sharing Mode."
USBIP_WINDOW_MESSAGE7					=	"Server  ( %s ) configuration saved successfully !!"
USBIP_WINDOW_MESSAGE8					=	"Restoring factory default values. Do you want to continue?"
USBIP_WINDOW_MESSAGE9					=	"Restore factory default values successful !!"
USBIP_WINDOW_MESSAGE10					=	"Restored Factory Defaults Failed !!"
USBIP_WINDOW_MESSAGE11					=	"StartDeviceRequestServerThread Failed!!"
USBIP_WINDOW_MESSAGE12					=	"The application was terminated abnormally and may not behave properly.\nIt is recommended to restart the PC"
USBIP_WINDOW_MESSAGE13					=	"Software error"
USBIP_WINDOW_MESSAGE14					=	"Could not stop the USBIP-Service"

;-------------------------------------------------------------------------------------------------------

;To Set the main titles for Device Details View
 
DETAILS_FORM_VIEW_TITLE_DEVICE_DETAILS			=	"Device Details"
DETAILS_FORM_VIEW_TITLE_SERVER_DETAILS			=	"Server Details"
DETAILS_FORM_VIEW_TITLE_CONNECTED_CLIENTS		=	"Connected Clients  (IP : USB Port)"

;-------------------------------------------------------------------------------------------------------

;To Set the main title & column titles of bottom form view (Server Manager)

BOTTOM_FORM_VIEW_SERVER_MANAGER_TITLE			=	"Server Manager Log"
BOTTOM_FORM_VIEW_SERVER_MANAGER_COLUMN1			=	"S.No."
BOTTOM_FORM_VIEW_SERVER_MANAGER_COLUMN2			=	"Date : Time"
BOTTOM_FORM_VIEW_SERVER_MANAGER_COLUMN3			=	"Description"
BOTTOM_FORM_VIEW_ERROR_MESSAGE1				=	"Unable to create the log file"
BOTTOM_FORM_VIEW_ERROR_MESSAGE2				=	"Unable to Save file"

;-------------------------------------------------------------------------------------------------------

;Save Bottom Form List Info Message strings

SAVE_BOTTOM_FORM_LIST_INFO_MESSAGE1			=	"File with the same name already exists. Enter a different name."
SAVE_BOTTOM_FORM_LIST_INFO_MESSAGE2			=	"Please Enter the file path !!"

;-------------------------------------------------------------------------------------------------------

;Server Configuration Message strings

SERVER_CONFIGURATION_MESSAGE1				=	"Error in saving the configuration !!"
SERVER_CONFIGURATION_MESSAGE2				=	"Some of the devices are connected to this server. Please disconnect before changing the settings."
SERVER_CONFIGURATION_MESSAGE3				=	"Error in getting the configiration !!"

;-------------------------------------------------------------------------------------------------------

;Threads Message strings

THREADS_MESSAGE1					=	"One of the device/server is not unloaded properly.\n\nIt is recommended to reboot the PC.\n\nPress OK to Reboot the System (OR) CANCEL to Reboot Later."
THREADS_MESSAGE2					=	"Some of the devices may not work properly.\n\nPress 'OK' to proceed further."

;-------------------------------------------------------------------------------------------------------

;Unlock Dialog Box Message strings

UNLOCK_DIALOG_BOX_MESSAGE1				=	"Unlock successful !!"
UNLOCK_DIALOG_BOX_MESSAGE2				=	"Unlock Failed!!"

;-------------------------------------------------------------------------------------------------------

;Upgrade Firmware Dialog Message Strings

UPGRADE_FIRMWARE_DIALOG_MESSAGE1			=	"Enter the path & press Transfer button."
UPGRADE_FIRMWARE_DIALOG_MESSAGE2			=	"This is not a valid FW image. Please select a correct file !!"
UPGRADE_FIRMWARE_DIALOG_MESSAGE3			=	"Same FW available on board, update not required !!"
UPGRADE_FIRMWARE_DIALOG_MESSAGE4			=	"Latest FW available on board, update not required !!"
UPGRADE_FIRMWARE_DIALOG_MESSAGE5			=	"Fail to start TFTP Server Application.!!"
UPGRADE_FIRMWARE_DIALOG_MESSAGE6			=	"Fail to stop TFTP Server Application.!!"

;-------------------------------------------------------------------------------------------------------

;To Set the main title & column titles of bottom form view (Device Mapping)

BOTTOM_FORM_VIEW_DEVICE_MAPPING_TITLE			=	"Device Mapping Log"
BOTTOM_FORM_VIEW_DEVICE_MAPPING_COLUMN1			=	"S.No."
BOTTOM_FORM_VIEW_DEVICE_MAPPING_COLUMN2			=	"Date : Time"
BOTTOM_FORM_VIEW_DEVICE_MAPPING_COLUMN3			=	"Description"

;-------------------------------------------------------------------------------------------------------

;To Set the text for Left tree view icons

LEFT_TREE_VIEW_ICON_TITLE_FOR_DEVICE_MAPPING		=	"Device Mapping"
LEFT_TREE_VIEW_ICON_TITLE_FOR_SERVER_MANAGER		=	"Server Manager"

;-------------------------------------------------------------------------------------------------------

;To Set the main title and column titles of center view (Device Mapping)

DEVICE_MAPPING_CENTER_VIEW_MAIN_TITLE			=	"Device Mapping"
DEVICE_MAPPING_CENTER_VIEW_TITLE_FOR_COLUMN1		=	"Device Info"
DEVICE_MAPPING_CENTER_VIEW_TITLE_FOR_COLUMN2		=	"Port"
DEVICE_MAPPING_CENTER_VIEW_TITLE_FOR_COLUMN3		=	"Class"
DEVICE_MAPPING_CENTER_VIEW_TITLE_FOR_COLUMN4		=	"Status"
DEVICE_MAPPING_CENTER_VIEW_TITLE_FOR_COLUMN5		= 	"Auto-Connect"

;-------------------------------------------------------------------------------------------------------

;To Set the main title and column titles of center view (Server Manager)

SERVER_MANAGER_CENTER_VIEW_MAIN_TITLE			=	"Server Manager - Found Server(s):"
SERVER_MANAGER_CENTER_VIEW_TITLE_FOR_COLUMN1		=	"S.No."
SERVER_MANAGER_CENTER_VIEW_TITLE_FOR_COLUMN2		=	"Model"
SERVER_MANAGER_CENTER_VIEW_TITLE_FOR_COLUMN3		=	"MAC Address"
SERVER_MANAGER_CENTER_VIEW_TITLE_FOR_COLUMN4		=	"IP Address"
SERVER_MANAGER_CENTER_VIEW_TITLE_FOR_COLUMN5		=	"Status"

;-------------------------------------------------------------------------------------------------------

;To set the text to be displayed on tray tooltip.

TRAY_TOOLTIP_NAME					=	"USBIP Admin Utility"

;-------------------------------------------------------------------------------------------------------

;To set the tool tip text for toolbar (DEVICE_MAPPING)

TOOL_TIP_TEXT_DEV_MAP_START_DEVICE_MAPPING		=	"Start Device Mapping"
TOOL_TIP_TEXT_DEV_MAP_STOP_DEVICE_MAPPING		=	"Stop Device Mapping"
TOOL_TIP_TEXT_DEV_MAP_CONNECT				=	"Connect"
TOOL_TIP_TEXT_DEV_MAP_DISCONNECT			=	"Disconnect"
TOOL_TIP_TEXT_DEV_MAP_PRINTER_AUTO_CONNECT		=	"Printer Sharing"
TOOL_TIP_TEXT_DEV_MAP_DEVICE_REQUEST			=	"Device Request"
TOOL_TIP_TEXT_DEV_MAP_DEVICE_SETTING			=	"Settings"

;-------------------------------------------------------------------------------------------------------

;To set the tool tip text for toolbar (SERVER_CONFIGURATION)

TOOL_TIP_TEXT_SRV_CFG_SERVER_CONFIGURATION		=	"Server Configuration"
TOOL_TIP_TEXT_SRV_CFG_UPGRADE_FW			=	"Upgrade Firmware"

;-------------------------------------------------------------------------------------------------------

;To set the control text on Device Request dialog.

DEVREQ_MSG_CTRL1					= 	"Requester :"
DEVREQ_MSG_CTRL2					=	"Requested Device :"
DEVREQ_MSG_CTRL3					= 	"Do you want to allow this request and free the requested device?"
DEV_REQ_SEND_MSG_SUCCESS				= 	"Successfully sent 'Free Device' request."
DEV_REQ_SEND_MSG_FAILED					= 	"Failed to send 'Free Device' request."

;-------------------------------------------------------------------------------------------------------

;To set the text to be displayed on device settings page.

DEVSETTING_TITLE					= 	"Setting"
APPSELECT_DIALOG_TILTE					= 	"Select an application to launch"
DEVSETTING_CONNECTION_SETTING				=	"Connection Settings"
DEVSETTING_CTRL1					=	"Select the auto connect settings for this device."
DEVSETTING_CHECK_AUTOCONNECT				=	"&Automatically connect this device"
DEVSETTING_CHECK_AUTORECONNECT				=	"&Reconnect the device if the connection is lost"
DEVSETTING_LAUNCHPROGRAM				=	"Launch Program"
DEVSETTING_CTRL2					= 	"Select a program that gets launched automatically when this device gets Connected."
DEVSETTING_CHECK_LAUNCHPROGRAM				=	"&Launch a program when this device connects"
DEVSETTING_STATIC_PROGRAM				=	"Program :"
IDS_ERRMSG_SELECTANAPPTOLAUNCH				= 	"Select an Application to be launched."
IDS_ERRMSG_PRINTERSHRCANNOTAUTOCNCT			= 	"Printer in AutoSharing Mode. Cannot AutoConnect."
DEVSETTING_ERR_APP_LAUNCH				=	"Error Launching the Application. Check the application chosen. !!"
DEVSETTING_SAVED_ENTRIES_DELAYED_EFFECT                 =       "Device is not present on the network. Changes will take effect from the next plug out or Link loss"


;-------------------------------------------------------------------------------------------------------
;To set the tool tip text for toolbar (HELP)

TOOL_TIP_TEXT_HELP					=	"Help"

;-------------------------------------------------------------------------------------------------------


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Table of Language Identifiers
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;Identifier 		Language 
;-----------------------------------------------------------------------------------------------------

;0x0404 		Chinese (Taiwan) 
;0x0804 		Chinese (PRC) 
;0x0c04 		Chinese (Hong Kong SAR, PRC) 
;0x1004 		Chinese (Singapore) 
;0x0409 		English (United States) 
;0x0809 		English (United Kingdom) 
;0x0c09 		English (Australian) 
;0x1009 		English (Canadian) 
;0x1409 		English (New Zealand) 
;0x1809 		English (Ireland) 
;0x1c09 		English (South Africa) 
;0x2009 		English (Jamaica) 
;0x2409 		English (Caribbean) 
;0x2809 		English (Belize) 
;0x2c09 		English (Trinidad) 
;0x040c 		French (Standard) 
;0x080c 		French (Belgian) 
;0x0c0c 		French (Canadian) 
;0x100c 		French (Switzerland) 
;0x140c 		French (Luxembourg) 
;0x0407 		German (Standard) 
;0x0807 		German (Switzerland) 
;0x0c07 		German (Austria) 
;0x1007 		German (Luxembourg) 
;0x1407 		German (Liechtenstein) 
;0x0421 		Indonesian 
;0x0410 		Italian (Standard) 
;0x0810 		Italian (Switzerland) 
;0x0411 		Japanese 
;0x0412 		Korean 
;0x0414 		Norwegian (Bokmal) 
;0x0814 		Norwegian (Nynorsk) 
;0x0415 		Polish 
;0x0416 		Portuguese (Brazil) 
;0x0816 		Portuguese (Portugal) 
;0x0418 		Romanian 
;0x0419 		Russian 
;0x040a 		Spanish (Spain, Traditional Sort) 
;0x080a 		Spanish (Mexican) 
;0x0c0a 		Spanish (Spain, Modern Sort) 
;0x100a 		Spanish (Guatemala) 
;0x140a 		Spanish (Costa Rica) 
;0x180a 		Spanish (Panama) 
;0x1c0a 		Spanish (Dominican Republic) 
;0x200a 		Spanish (Venezuela) 
;0x240a 		Spanish (Colombia) 
;0x280a 		Spanish (Peru) 
;0x2c0a 		Spanish (Argentina) 
;0x300a 		Spanish (Ecuador) 
;0x340a 		Spanish (Chile) 
;0x380a 		Spanish (Uruguay) 
;0x3c0a 		Spanish (Paraguay) 
;0x400a 		Spanish (Bolivia) 
;0x440a 		Spanish (El Salvador) 
;0x480a 		Spanish (Honduras) 
;0x4c0a 		Spanish (Nicaragua) 
;0x500a 		Spanish (Puerto Rico) 
;0x041d 		Swedish 
;0x081d 		Swedish (Finland) 
;0x041e 		Thai 
;0x0452 		Welsh (United Kingdom)
